Repository: Marszu99/Szakdoga
Catalog: WpfDemo/TimeSheet.Resource/Resources.*.resx
Languages: hu_hu

source: Active Tasks
hu_hu: Aktív

source: Back
hu_hu: VISSZA

source: Cancel
hu_hu: MÉGSE

source: Change
hu_hu: MÓDOSÍT

source: Comment
hu_hu: Komment

source: Company
hu_hu: Cég

# CompanyName2DoesntMatch
source: Company2 doesn't match with Company!
hu_hu: A két cég név nem egyezik egymással!

# CompanyName2IsEmpty
source: Company2's name is empty!
hu_hu: Cég nevét megerősítő mező üres!

# CompanyNameIsEmpty
source: Company's name is empty!
hu_hu: Cég nevének mezője üres!

# CompanyNameWrongLength
source: Company's name have to reach minimum 10 characters and also can't be more than 60!
hu_hu: Cég neve legalább 10 és legfeljebb 60 karakter hosszú lehet!

source: Date
hu_hu: Dátum

# DateCantBeInFuture
source: Record's date can't be in the future!
hu_hu: Dátum nem lehet későbbi a mai napnál!

# DateCantBePastTheTaskCreationDate
source: Record's date can't be earlier than the date when the task was created!
hu_hu: Dátum nem lehet a feladat létrehozásának dátumánál korább!

source: Date is empty!
hu_hu: Dátum mezeje üres!

source: Deadline
hu_hu: Határidő

source: Deadline is empty!
hu_hu: Határidő mezeje üres!

# DeadlineMoreThan24Hours
source: Deadline has to be atleast more than 24 hours away from the current time!
hu_hu: A határidőnek legalább 24 órával később kell lennie mint a jelenlegi idő!

source: Delete
hu_hu: Törlés

source: Description
hu_hu: Leírás

source: Done Tasks
hu_hu: KÉSZ

source: Duration
hu_hu: Időtartam

# DurationCantBeHigher12Hours
source: Duration can't be higher than 12 hours!
hu_hu: Időtartam nem lehet több 12 óránál!

# DurationCantBeLowerZero
source: Duration can't be lower than 0!
hu_hu: Időtartam nem lehet kevesebb 0-nál!

# Email2DoesntMatch
source: Email2 doesn't match with Email!
hu_hu: A két email nem egyezik egymással!

source: Email2 is empty!
hu_hu: Emailt megerősítő mező üres!

source: Email is empty!
hu_hu: Email mezeje üres!

# EmailIsInvalid
source: Invalid email!
hu_hu: Helytelen email!

# EmailWrongLength
source: Email have to reach minimum 11 characters and also can't be more than 100!
hu_hu: Email legfeljebb 100 karakter hosszú lehet!

source: FirstName
hu_hu: Keresztnév

source: FirstName is empty!
hu_hu: Keresztnév mezeje üres!

# FirstNameNoNumbers
source: FirstName needs to be one word that contains only letters of the alphabet!
hu_hu: Keresztnév nem tartalmazhat betűkön kívül más karaktereket!

# FirstNameWrongLength
source: FirstName have to reach minimum 3 characters and also can't be more than 45!
hu_hu: Keresztnév legalább 3 és legfeljebb 45 karakter hosszú lehet!

source: Information
hu_hu: INFORMÁCIÓ

source: Language
hu_hu: NYELV

source: LastName
hu_hu: Vezetéknév

source: LastName is empty!
hu_hu: Vezetéknév mezeje üres!

# LastNameNoNumbers
source: LastName needs to be one word that contains only letters of the alphabet!
hu_hu: Vezetéknév nem tartalmazhat betűkön kívül más karaktereket!

# LastNameWrongLength
source: LastName have to reach minimum 3 characters and also can't be more than 45!
hu_hu: Vezetéknév legalább 3 és legfeljebb 45 karakter hosszú lehet!

source: Login
hu_hu: BELÉPÉS

# LoginErrorMessage
source: Invalid username or password!
hu_hu: Helytelen a felhasználónév vagy a jelszó!

source: Logout
hu_hu: KILÉPÉS

# LogoutMessage
source: Are you sure you want to logout?
hu_hu: Biztos, hogy ki akar jelentkezni?

source: My Profile
hu_hu: PROFILOM

source: My Records
hu_hu: Rögzítéseim

source: My Tasks
hu_hu: Feladataim

# NeedToChooseTaskForRecord
source: Need to choose a Task for the record!
hu_hu: Kell választani egy feladatot a rögzítéshez!

# NeedToChooseUserForTask
source: Need to choose a User for the task!
hu_hu: Kell választani egy felhasználót a feladathoz!

# NotificationNewTask
source: New task!
hu_hu: Új feladat!

source: Notifications
hu_hu: Értesítések

# NotificationTaskDeadlineChanged
source: Task has been updated! Deadline has changed!
hu_hu: Feladat módosítva lett! Határidő megváltozott!

# NotificationTaskDescriptionChanged
source: Task has been updated! Description has changed!
hu_hu: Feladat módosítva lett! Leírás megváltozott!

# NotificationTaskDone
source: Task has been Done!
hu_hu: Feladat elkészült!

# NotificationTaskInProgress
source: Task is InProgress!
hu_hu: Feladat folyamatban van!

# NotificationTaskTitleChanged
source: Task has been updated! Title has changed!
hu_hu: Feladat módosítva lett! Cím megváltozott!

# NotificationTaskTitleDescriptionDeadlineChanged
source: Task has been updated! Title and Description and Deadline has changed!
hu_hu: Feladat módosítva lett! Cím, leírás és határidő megváltozott!

source: Password
hu_hu: Jelszó

# Password2DoesntMatch
source: Password2 doesn't match with Password!
hu_hu: A két jelszó nem egyezik egymással!

source: Password2 is empty!
hu_hu: Jelszót megerősítő mező üres!

source: Password is empty!
hu_hu: Jelszó mezeje üres!

# PasswordOneWord
source: Password needs to be one word!
hu_hu: Jelszónak egy szónak kell lennie!

# PasswordWrongLength
source: Password have to reach minimum 6 characters and also can't be more than 45!
hu_hu: Jelszó legalább 6 és legfeljebb 45 karakter hosszú lehet!

source: Profile
hu_hu: PROFIL

source: Record
hu_hu: Rögzítés

# RecordCreatedMessage
source: Record has been created succesfully!
hu_hu: Sikeres rögzítés!

# RecordDeletedMessage
source: Record has been deleted succesfully!
hu_hu: Rögzítés sikeresen törölve!

# RecordDeleteQuestion
source: Are you sure you want to delete this record?
hu_hu: Biztos törölni akarja ezt a rögzítés?

source: Records
hu_hu: RÖGZÍTÉSEK

# RecordUpdatedMessage
source: Record has been updated succesfully!
hu_hu: Rögzítés sikeresen módosítva!

source: Register
hu_hu: REGISZTRÁL

source: Registration
hu_hu: Regisztráció

source: Save
hu_hu: MENT

source: Search
hu_hu: Keresés

source: Server error!
hu_hu: Szerver hiba!

source: Status
hu_hu: Státusz

# StatusCannotBeCreatedWithRecords
source: Status cannot be "Created" when there is recods for the task!
hu_hu: Státusz nem lehet "Létrehozott", ha vannak a feladathoz rögzítések!

# StatusCannotBeDoneWithNoRecords
source: Status cannot be "Done" when there is no recods for the task!
hu_hu: Státusz nem lehet "Kész", ha nincs a feladathoz rögzítés!

source: Task
hu_hu: Feladat

# TaskCreatedMessage
source: Task has been created succesfully!
hu_hu: Feladat sikeresen létrehozva!

# TaskDeletedMessage
source: Task has been deleted succesfully!
hu_hu: Feladat sikeresen törölve!

# TaskDeleteQuestion1
source: Are you sure you want to delete
hu_hu: Biztos, hogy törölni akarja

# TaskDeleteQuestion2
source: task?
hu_hu: feladatot?

source: Tasks
hu_hu: FELADATOK

# TaskUpdatedMessage
source: Task has been updated succesfully!
hu_hu: Feladat sikeresn módosítva!

source: Telephone
hu_hu: Telefonszám

source: Telephone is empty!
hu_hu: Telefonszám mezeje üres!

# TelephoneIsInvalid
source: Invalid telephone number!
hu_hu: Helytelen telefonszám!

source: Title
hu_hu: Cím

source: Title is empty!
hu_hu: Cím mezeje üres!

# TitleWrongLength
source: Title can't be more than 45 characters!
hu_hu: Cím nem lehet 45 karakternél hosszabb!

source: ToDo Tasks
hu_hu: ELVÉGZENDŐ

source: User
hu_hu: Felhasználó

# UserCreatedMessage
source: User has been created succesfully!
hu_hu: Felhasználó sikeresen létrehozva!

# UserDeletedMessage
source: User has been deleted succesfully!
hu_hu: Felhasználó sikeresen törölve!

# UserDeleteQuestion1
source: Are you sure you want to delete
hu_hu: Biztos, hogy törölni akarja

# UserDeleteQuestion2
source: user?
hu_hu: felhasználót?

source: Username
hu_hu: Felhasználónév

# UsernameAlreadyExists
source: already exists!
hu_hu: már létezeik!

source: Username is empty!
hu_hu: Felhasználónév mezeje üres!

# UsernameOneWord
source: Username needs to be one word!
hu_hu: Felhasználónévnek egy szónak kell lennie!

# UsernameWrongLength
source: Username have to reach minimum 6 characters and also can't be more than 45!
hu_hu: Felhasználónév legalább 6 és legfeljebb 45 karakter hosszú lehet!

# UserUpdatedMessage
source: User has been updated succesfully!
hu_hu: Felhasználó sikeresen módosítva!

source: Warning!
hu_hu: FIGYELMEZTETÉS!
